#стартовая страница, пока не открылись вкладки задач

import streamlit as st  #Streamlit — это фреймворк для языка программирования Python

def start():  #tabs - это вкладки; number - номер данной вкладки, который передаётся из Main

    st.title("Наша СППР")

    st.write("Данный сайт представляет собой систему поддержки принятия решений для задач финансово-экономического сектора.")

    st.info("Система поддержки принятия решений (СППР) — человеко-машинный объект, который позволяет лицам, принимающим решения (ЛПР), использовать исходные данные, знания для анализа и решения задачи принятия решений (ЗПР).")
    st.info("Лицо, принимающее решения (ЛПР) — субъект (зачастую человек), который взаимодействует с СППР с целью решения стоящей перед ним ЗПР.")
    st.info("Задача принятия решений (ЗПР) — задача, состоящая в формировании множества возможных решений с помощью СППР, обеспечивающих её разрешение при существующих ограничениях, и выделении среди этих решений одного лучшего или нескольких предпочтительных, удовлетворяющих предъявляемым к ним требованиям со стороны ЛПР.")

    st.write("Главной особенностью системы поддержки принятия решений является метод организации взаимодействия человека и компьютера. Важно, что выработка решения происходит в результате итерационного процесса.")
    st.image("https://i.postimg.cc/gJk03Mr7/image.png", caption = "Схема взаимодействия СППР и ЛПР")

    st.write("Работа выполнена студентами 4-го курса 441-ой группы мех-мата СГУ Володиным Максимом Сергеевичем и Трибис Инной Александровной.")
    col1, col2 = st.columns(2)
    col1.image(["https://i.postimg.cc/Y9bzxyRL/image.jpg"], caption = ["Теоретик-тестировщик Володин М.С"])
    col2.image(["https://i.postimg.cc/hGn8Rq37/image.jpg"], caption = ["Программист-аналитик Трибис И.А"])
